[
  {
    "_id": "64ca8e3bb5d23529cbb95333",
    "versions": [
      {
        "_id": "64f60d452af81093b3d6df85",
        "title": "Professional Introduction",
        "post": "Welcome to the Blog zone, just read this first page in case you are the recruiter that is doing the candidates selection, here you will find the most complete summary of my career until this point, the other posts will be more personal, anyway feel free to read them, after all, i will be completely sincere in those posts, showing my virtues and flaws, so here goes the summary :)\n\nAs said before, my name is Gustavo, i’m a full stack developer, a designer in my free time, and an amateur musician, i started learning different things since i was a child, o learned english alone, practicing a lot, and by practicing i mean that i was playing alone, and trying to speak english like the games i played, although it may sound a bit weird, it helped me a lot learning a new language, as for my profession, i always knew i wanted to work with computers, so when i made 14, i entered in the course of Analysis and systems development and started programming, as for the designing part, it was a hobby, i always liked messing around in photoshop, mainly making textures for PES 6, but i never dedicated fully into this, like i dedicated to programming. With that said, I think I'm a decent developer, i mean, i made this website, so you judge.\n\nFor said course, the main function of it for me was to show me the basics of programming, and how to take the first steps, in the beginning i definitely wasn’t the best developer of the class, far from it, i didn’t had the talent, but i had a lot of determination, it was my chance of being successful in life, so i was getting better and better, and although i didn’t became the best in the class, i was way better, after working a lot, through different works that I did over time, among different subjects, that taught me many things, like how analyze systems, build decent layouts, and of course, how to think like an dev, in this journey i used mainly JS and C#, and although i didn’t used a lot of C# after graduating, mainly because i decided to focus in the web part, but i’m resuming my studies in C#.\n\nThe final proof of my capacity as a developer, was my final app for the course, in it i made an android app for stock control and sales, the main differential of it was the aim public, normal people that are starting a business or people that still uses old methods, like pen and paper, it was an simple premise, that i had a lot of difficulties, mainly due to the short deadline, only 6 months, and the fact that due to the pandemic, my group only had me as a developer, since most of the class stop caring to the course part (it was a course integrated to middle school), and the ones that were devs, already were in other groups, so with all that i had to fully dedicate to this project, i even had some bad grades at other classes, but it was worth, at the end of december not only i had finished the app, i also learned a lot of stuff, mainly concepts of React and Node. Even though I couldn't include all that I wanted, I still would say it turned out great.\n\nAfter this last school project, i entered in a tech company, i usually say that it was like an paid college, since i evolved a lot as a worker and as a person, at the beginning they put me to work in an test project, something simple, a Forex tool, that showed an real time graphic, in it the person could simulate the act of buying or selling coins, with no real money involved.\n\nI managed to finish the project within a month, and so i started working for real, due to legal reasons i won’t say any name, instead i will describe the project, it was basically an management app for skin care company, it had a lot of stuff, and schedule, registration of products, employees and treatments, an P.O.S. etc, i didn’t enter in the beginning of the project, but i worked in it for almost a year, finishing after our contract with the client ended, i believe that the main thing i added alone, was a new payment system, it was really hard, mainly because the old system was old and buggy, and because it had to be secure, since it was dealing with money.\n\nAfter eight months, i exit from the project and go to another, it was an website to find job opening, the main differential, was that the company would seek the employee, and it would have some tests to evaluate the candidates, in other words something like GeekHunter, we had two versions of the app, one more complex than the other, the first one it was where i learned the basics of AWS, and evolved as a developer.\n\nIn february i decided to exit the company, i wasn’t satisfied with some attitudes from the leadership, and so here i’m i.",
        "date": "2023-08-08T19:48:30.462Z",
        "locale": "en-US"
      },
      {
        "_id": "64f60d452af81093b3d6df86",
        "title": "Introdução Profissional",
        "post": "Bem vindo ao espaço do meu Blog, caso você seja o recrutador que está fazendo a seleção de candidatos, apenas leia essa primeira página, nela têm o resumo mais completo da minha carreira até esse ponto, os outros posts vão ser algo mais pessoal, sinta-se livre para ler eles, afinal eu sou completamente sincero nesses posts, mostrando minha qualidades e falhas, enfim, aqui vai o resumo, boa leitura.\n\nComo dito anteriormente, me chamo Gustavo, sou um dev FullStack, designer nas horas vagas e um aspirante a músico, Comecei aprendendo coisas diferentes desde cedo, aprendi inglês sozinho, praticando enquanto criança, e com praticando eu quero dizer brincando sozinho e falando em inglês igual aos jogos que jogava, apesar de ser um comportamento estranho, foi algo muito benéfico para mim, quanto a minha profissão eu sempre soube que queria trabalhar com computadores, comecei a programar aos 14 anos quando entrei no curso de Análise e desenvolvimento de sistemas, quando a parte do designer, sempre foi um hobby, é algo que eu gosto de fazer, adorava brincar no photoshop, fazendo texturas pro PES 6, mas não dediquei tanto tempo como dediquei a programação, dito isso, acho que sou um designer decente, bem eu quem fiz esse site então julgue você mesmo.\n \nQuanto a esse curso, a principal função dele foi me apresentar ao básico da programação, e como dar os primeiros passos, no começo eu definitivamente não era o melhor programador da sala, bem longe disso, não tinha o talento, mas eu tinha muita vontade, visto que eu não tinha outra chance de ser bem sucedido no tempo que eu tinha, então lá fui eu, praticando cada vez mais, até que fui melhorando aos pouco, e apesar de que eu não me tornei o melhor da sala, eu melhorei demais, por meio de diversos trabalhos que fiz ao longo do tempo, entre diversas matérias, que me ensinaram a Analisar sistemas, construir layouts decentes, e é claro, a pensar como um dev. nessa jornada usei principalmente JS e C#, apesar de que não utilizei muito o C# Desde que saí da escola, principalmente pela escolha de carreira que fiz, mas estou retornando com meus estudos com C#.\n\nEnfim a prova final da minha capacidade foi meu trabalho de conclusão de curso, ou TCC, nele eu fiz um aplicativo para android para controle de estoque e vendas, o principal diferencial dele era ser aberto pro público, e focado para um comércio menor, que ainda não abraçou a era tecnológica, apesar de uma premissa simples, eu tive certas dificuldades, principalmente por causa do prazo e da minha equipe, devido a pandemia eu acabei pegando um grupo fraco, eu era o único programador, e tinha que fazer algo esse trabalho em um prazo de 6 meses junto da reta final da escola, vale dizer que nesses últimos meses me dediquei completamente ao projeto, até tirei umas notas vermelhas em outras matérias, mas no final valeu a pena, visto que tive um aprendizado gigante, principalmente com o React e Node JS, e consegui entregar o projeto completamente funcional, não tinha todas as coisas que eu gostaria, mas mesmo assim, diria que ficou ótimo.\n \nApós esse projeto, eu logo consegui entrar em uma empresa da área, costumo dizer que foi uma espécie de faculdade paga, visto que eu evoluí muito como funcionário e como pessoa, a princípio comecei trabalhando em um projeto para me testar, algo simples, uma ferramenta para FOREX, onde exibia um gráfico em tempo real, e a pessoa poderia comprar ou vender moedas, dependendo do movimento da moeda ele perdia ou ganhava dinheiro, é claro que isso era só uma simulação, nenhum dinheiro estava envolvido.\n\nConsegui terminar o projeto em um prazo de um mês, e assim comecei a trabalhar na empresa, por confidencialidade e pelo meu antigo contrato, não vou citar nomes de nada, por isso vou descrever o que era o projeto, era basicamente um site para gerenciamento de empresas para skin care, era um site bem completo, tinha de tudo , uma agenda, cadastro de produtos, funcionários, tratamentos, sistema de pagamento entre outros, não entrei no projeto desde o começo, mas trabalhei nele em um ano, acredito que a principal coisa que adicionei foi um método de pagamento novo, foi bem difícil, principalmente porque eu tinha que me garantir que era seguro, pois mexia com dinheiro.\n\nOito meses após entrar eu saio desse projeto, e vou para outro da casa, esse era um site para procurar vagas de emprego, o diferencial seria que a empresa procuraria o funcionário, e que teríamos testes para avaliar os candidatos antes mesmo deles se candidatarem, gerando assim uma nota para eles, mais ou menos no naipe do GeekHunter com a parte dos testes, tivemos duas versões do app, uma mais complexa, onde eu aprendi o básico de AWS, e elevei o nível das minhas habilidades gerais (visto que o código do outro projeto era uma grande bagunça feita por juniors) e uma segunda versão, mais simples, que eu fiz desde o começo.\n\nDepois de Fevereiro eu decidi sair da empresa, já não estava mais satisfeito com certas atitudes da liderança, cá estou eu agora.",
        "date": "2023-08-08T19:48:30.462Z",
        "locale": "pt-BR"
      }
    ]
  },
  {
    "_id": "64cbe8b26a59abf0c95ce815",
    "versions": [
      {
        "_id": "64f60d452af81093b3d6df87",
        "title": "First Personal Post",
        "post": "So, this is the actual first post of this portfolio/blog, I’ve always heard other devs saying that it is a good idea to write a blog, even if no one reads, so this is what i’m doing, i might transform this into a diary, having some sort of track of my productivity.\n\nBefore i continue on this small first post, i have to say that i myself i’m writing this translation, because i think is kind of cheating to use like google translate and then keep reaffirming that i know english, despite not actually showing, so here i am, showing it,i also want to bring that those will be my text revisions, so there might be some differences between the versions, i also want to throw some easter eggs into it, just because i can.\n\nAlso for some sort of constancy i will be posting every friday from now on, which makes this a “weekly” and not a diary (i think?) Anyway, the posts will not always be code-related, i will write about other stuff, maybe other projects i will be doing.",
        "date": "2023-08-02T17:14:49.929Z",
        "locale": "en-US"
      },
      {
        "_id": "64f60d452af81093b3d6df88",
        "title": "Primeiro Post Pessoal",
        "post": "Bem esse é o real primeiro post do meu portfólio, sempre ouvi outros devs falando que era uma boa escrever um blog, mesmo que ninguém fosse ler, é bem é isso que estou fazendo, talvez eu transforme isso em uma espécie de diário, seria uma boa para falar a verdade, assim dá pra manter um track da minha produtividade.\n\nPara ter alguma constância eu vou fazer um post todas às sextas feiras, o que torna isso um “semanário” e não um diário (eu acho?), detalhando o que eu fiz nessa semana, mesmo que seja algo que não tenha haver com programação, também irei falar sobre outros projetos meus aqui.\n",
        "date": "2023-08-02T17:14:49.929Z",
        "locale": "pt-BR"
      }
    ]
  },
  {
    "_id": "64d685205d2542bc75705d16",
    "versions": [
      {
        "_id": "64f60d452af81093b3d6df89",
        "title": "First week: Cliger and the Guitar",
        "post": "it’s literally the first week and i almost forgot to write this, okay so first, keep in my i’d might alter the format and the usual stuff i write here, so for the first week, i will tell you what i did, i began the week by finishing the portfolio, it took a bit longer than i thought because i decided to translate the whole site to english and portuguese, which was, way boring than i thought it would be, mainly the professional introduction text, which i wrote in april, and forgot to translate, it took a whole day to do because it was so boring to do, and to be honest i wasn’t really that much productive this week, mainly because i finally got an acoustic guitar, and i’m learning how to play, more on that later.\n\nReturning to programming, after finishing the portfolio i decided to see if i could run my final course project, which is called cliger, it is my most complete project and it would be a great addition to my portfolio, with that said i always knew that it was going to be a pain in the ass to make this run again, first i had to set the android emulator, which was way easier than it was 2 years ago, after that i had to figure out why the app wasn’t even running, it was installing and all, but it never bundled, so i started debugging, and apparently it was something in the config files that were not updated or something like that, i decided that it was easier to create a new project and replace the necessary files than fixing the config files from the older one.\n\nThen another problem, another thing was old and not working, and since i don’t want to keep repeating myself (because this happens again more than three times) i will just move to the current state of the app, it is opening !!! but i still have a lot of thing to fix, i noticed that after installing ESlint (which i didn’t knew it existed was back in the day) i was shocked to see that it returned me a whopping 6500+ errors, which i wasn’t going to fix because i love myself, so i re-installed with an less strict ruleset, and now i have about 54 errors to fix, which still more than i wish it was (0) but now i can realistically see me fixing all of that.\n\nSo, about the guitar, i will be brief, but since i started to listen to music seriously i wanted an actual instrument, so i bought an old guitar from my cousin, and bought new chords (the old one only had the A and the G chord) and since then, i’m playing it, is as hard as i thought it would be, which means that i’m struggling a lot to play it, but it is really fun to do, and i want to get better at it, maybe one day record an EP, i really wanted to do this, and i wish i can fulfill this dream.\n\nSo yeah, I think this was my week. Maybe I should add a commentary tab so you can leave a commentary, but yeah, goodbye and goodweekend.",
        "date": "2023-08-11T19:05:35.095Z",
        "locale": "en-US"
      },
      {
        "_id": "64f60d452af81093b3d6df8a",
        "title": "Primeira semana: Cliger e o Violão",
        "post": "Essa é literalmente a primeira semana desse blog e eu quase esqueci de escrever isso, ok primeiramente, saiba que eu talvez mude o formato e as coisas que escrevo aqui, mas para a primeira semana eu vou simplesmente contar o que aconteceu, eu comecei a semana finalizando o portfólio, acabou demorando mais do que eu gostaria porque eu decidi traduzir o site inteiro para português e inglês, o que foi bem mais entediante do que achei que seria, principalmente o texto de introdução profissional, eu escrevi ele em português, lá pra abril e esqueci de traduzir, levou o dia inteiro pra traduzir e foi tão chato de se fazer (inclusive eu percebi que era mais fácil escrever primeiro em inglês e depois traduzir para portugues, acho que por saber mais expressões em português adaptar elas pro inglês é mais difícil, porém adicionar elas depois na tradução é mais fácil ), pra ser honesto eu não acho que essa foi semana muito produtiva, principalmente porque eu finalmente consegui meu violão, e eu estou aprendendo como que toca, mais sobre isso depois.\n\nVoltando pra programação, após terminar meu portfólio, eu decidi ver se conseguia rodar o projeto do meu TCC, chamado cliger, é o projeto mais completo que eu já fiz, e eu acredito que seria uma ótima adição ao meu portfólio, dito isso, eu primeiramente precisava configurar o emulador de android, o que foi, bem mais fácil do que foi da primeira vez, 2 anos atrás, depois disso instalei o app e não estava rodando, comecei a debugar e aparentemente era algo nas configurações que não estava atualizado, ou algo do tipo, era tanto erro que percebi que seria mais fácil criar um projeto novo, e colocar os arquivos necessários, do que tentar arrumar os arquivos de configuração antigos, então assim eu fiz.\n\nEntão, mais um problema, outra coisa estava velha e sem funcionar, e olha, eu não quero ficar aqui me repetindo, pois esse mesmo problema ocorre mais umas 3 vezes em arquivos sem relação nenhuma, por isso vou focar no estado atual do aplicativo, e bem, está abrindo!!! mas eu ainda tenho um monte de coisa pra consertar, percebi isso depois de instalar o ESlint, e eu fiquei chocado em ver ele me retornando mais de 6500 erros, e eu obviamente não ia concertar tudo aqui, pois eu me amo, então escolhi um ruleset menos restrito, e agora neste momento eu tenho 54 erros para consertar, o que é mais do que eu queria (0 erros, no caso), mas agora pelo menos eu posso me ver consertando eles.\n\nSobre o violão, eu vou tentar ser breve, desde que eu comecei a escutar música seriamente, eu queria ter um instrumento de verdade, então eu compre um violão antigo da minha prima, e comprei cordas novas (as antigas só tinha o A e o G) e desde então eu estou tocando, e é tão difícil quanto eu imaginava que seria, ou seja estou tendo dificuldades para tocar, mas ao mesmo tempo é bem divertido aprender a tocar, espero poder ficar melhor nisso, quem sabe um dia gravar um EP, eu gostaria muito de fazer isso, e eu quero comprir esse sonho.\n\nEntão é, acho que essa foi minha semana, talvez eu devesse adicionar uma aba para comentários, aí você poderia falar algo, mas por hoje é só, adeus, e bom final de semana.",
        "date": "2023-08-11T19:05:35.095Z",
        "locale": "pt-BR"
      }
    ]
  },
  {
    "_id": "64e8ac61738aca22057a69f9",
    "versions": [
      {
        "_id": "64f60d452af81093b3d6df8b",
        "title": "Second & Third weeks",
        "post": "Last week was total ass, absolutely everything that could go wrong went wrong, for real, i was going to post this last Friday, but i was so burned out by all that crap, and I’d barely had any time to code anything, so i delayed to Saturday, and them Sunday… then Monday, and when Tuesday arrived, i decided that i wanted now i will post every other week. Kind of funny that this could be avoided, if I did what I'm doing right now, writing this text on a Wednesday.\n\nAnyway, last week when i wasn’t depressed or life wasn’t screwing with me, i was working in Cliger, turns out there were more bugs than i thought, some of them took me a whole day to fix, like the password recovery, which not only wasn’t broken (Google just changed the rules to sent emails, and i had to reconfigure it) but i’m pretty sure no one will actually use it, i mean, is not like a lot of people will actually use cliger, but if they decided to test it, they wouldn't configure it to use, mainly because it’s kind of time consuming to set the email (i still linked a tutorial in the .env.example in case you really want to test it). I also fixed some issues with the new Date, apparently react native changed the accepted strings to convert to date, and that broke some things, like, before i could just type “new Date(‘24-08-2023’)” and it worked, but now i have to send  “new Date(‘2023-08-24T00:00:00.000Z’)”, is not that big of a difference, but as many things in coding, it took longer for me to find out what was the issue, than fixing the issue, which btw, when i found what was causing the problem, i already had changed the entire back end function :) I'm not mad only because the original code was complicated just for the sake of being complicated, so simplifying it wasn’t a waste of time.\n\nWhat also wouldn’t be a waste of time but i didn’t make, was to make a .apk release of the app, Now, although compiling the app wasn’t going to be hard, the back-end part would cost me some money, because since i wrote the back-end to use a SQL Database, i didn’t found any free hosts, as i found with mongo, so i either paid for a back-end app that I’m not 100% sure is safe, or i could rewrite the whole thing in mongo, and i really didn’t think that it any of these alternatives will be worthy, maybe someday i rewrite the whole thing in mongo, but until them, if you want to experiment cliger, you will have to set it locally.\n\nNow for the blog part, so since i realized that i have time to spend improving myself, instead of being anxious for not having (i always had time) i decided to do it, so not only I’m playing guitar every single day (I’m finally can play come as you are, and some arpeggios), but i also I’m moving more, making some exercises, walking (to the groceries store) more, i wrote a big ass argument online, just for the sake of doing it, yesterday i went back to drawing, and I’m not playing as many video games as i used to, i still love games, but is just not as appealing as it was, i found other things that i also like just as much, but actually involves a skill more useful than playing games, the exception being Silent Hill 2, that game is the most miserable experience i had playing games in a while, and is fascinating.\n\n\nAlso, the main reason for me not writing the post on Saturday, was that i went to a house of a friend to practice for a band, i kind of entered as the bassist, i say kind of because there isn’t a band yet, is just me, my friend, and the instruments, we are still looking for a drummer, we already bought the kit, we just need someone to play it, i also will need to improve in the bass, which btw, i loved to play the bass, i love the sound, the big ass chords is just a blast.\n\nI also might be in love? For possibly the worst person for me to fall in love with, but no one cares about that, so I will just end this post here. Thanks for reading, and I will see you slackers on 07/09 or maybe next Friday, idk, bye bye.",
        "date": "2023-08-25T13:31:29.024Z",
        "locale": "en-US"
      },
      {
        "_id": "64f60d452af81093b3d6df8c",
        "title": "Segunda & Terceira semanas",
        "post": "Olha, semana passada foi uma droga completa, absolutamente tudo que poderia dar errado deu errado, na moral, eu ia postar sexta passada, mas eu tava tão cansado por tudo, eu mal tive tempo de programar, então eu adiei o post pra Sábado, e depois Domingo… e depois Segunda, na terça eu decidi que ia postar semana sim, semana não, engraçado que isso poderia ter sido evitado se eu tivesse o que estou fazendo agora, escrevendo o post numa Quinta.\n\nDe qualquer modo, semana passada quando a vida não estava me ferrando, eu estava trabalhando no Cliger, aconteceu que tinha mais bugs lá do que eu imaginava, alguns levaram dias inteiros, como quando eu arrumei o sistema de recuperação de senhas, que não só não estava quebrado (o Google só havia mudado algumas regras para mudar e-mails e eu tive que reconfigurar), eu também tenho certeza que quase ninguém vai querer testar isso, não vale a pena o esforço de configurar ele (mas se você realmente quiser tem um tutorial no .env.example). Eu também arrumei alguns problemas com o new Date, aparentemente o react native mudou as regras do que era aceitável para converter, antes eu poderia colocar  “new Date(‘24-08-2023’)” e funcionava, mas agora eu tenho que colocar  “new Date(‘2023-08-24T00:00:00.000Z’)” o que não é lá uma grande coisa,demorou mais para eu descobrir qual era o problema, do que demorou para consertá-lo, inclusive, quando eu descobri qual era o problema de verdade, eu já havia mudado a função inteira no Back-end :) só não fico maluco porque o código original era complicado simplesmente para ser complicado, não seria uma perda de tempo eu não simplificar ele.\n\nOutra coisa que também não seria uma perda de tempo, mas que eu não fiz, seria fazer uma release .apk do Cliger, e assim, compilar o App não seria difícil, o problema é que manter um banco SQL custaria dinheiro para ser feito, como eu não achei nenhum lugar para armazenar gratuitamente, eu fiquei com duas opções, ou eu (uma pessoa totalmente quebrada) pagava para manter um servidor que pouca gente vai usar e que não é 100% seguro, ou eu re-escrevia todo o server em Mongo, coisa que talvez eu faça algum dia, mas sinceramente, hoje eu não acho que vale a pena reescrever o Back-end inteiro, lamento, mas caso você queira experimentar o Cliger você terá que configurar ele localmente.\n\nOk agora para a parte do Blog mesmo, bem desde que eu percebi que tinha tempo para melhorar ao invés de ficar ansioso por não ter tempo (eu sempre tive tempo) eu decidi agir, agora eu estou tocando guitarra todos os dias (finalmente consigo tocar Come as you are e alguns arpejos) estou me movendo mais, fazendo mais exercícios, andando (para a lojinha da esquina) mais vezes, ontem eu voltei a desenhar, escrevi um argumento online gigante, simplesmente para ver se conseguia, também não estou mais jogando tanto videogames como fazia antes, não que eu não tenha deixado de jogar eles, mas sim que eu achei outras coisas que gostava de fazer tanto quanto jogar, algumas dessas coisas sendo habilidades mais úteis do que jogar (como interagir socialmente), a exceção da regra sendo o jogo Silent hill 2, eu nunca joguei um jogo tão miserável e deprimente quando este, simplesmente fascinante.\n\nA Propósito, o principal motivo para eu não ter postado esse post no sábado, foi que eu havia saído pra a casa de um amigo para ensaiar pra uma banda, eu meio que entrei como o baixista, digo meio, porque não tem uma banda banda ainda, tem só eu, ele e os instrumentos, ele já comprou uma bateria, mas se quer temos com quem tocar, ainda estamos procurando, eu também vou ter que melhorar bastante no baixo, que, inclusive eu adorei tocar, adorei o som, as cordas grandes, é simplesmente gostozin. \n\nBem eu acho que é isso, eu vou encerrar esse post por aqui, espero que tenha gostado de ler, vejo vocês dia 07/09 ou talvez semana que bem, sla, tchau.",
        "date": "2023-08-25T13:31:29.024Z",
        "locale": "pt-BR"
      }
    ]
  },
  {
  "_id": "64fb73964f5cd2454fbcbfb8",
  "versions": [
    {
      "title": "Fourth and fifth weeks",
      "post": "The Fourth Week was weird, at first i was going to update the Another Flix project, but on Monday i went to work with my dad, then at tuesday i discovered that the app that i used to host the portfolio API was going to charge me if i used more, so i went to AWS to find a way to fix that, i didn’t even knew if i could use AWS, last year i went to create a personal account and it required a specific type of credit card, but fortunately they updated and i could use my card. At first i tried to use EC2, it took me a whole day to set my account and to make the EC2 server even open, then another day to fix the node server to run pm2, then for some reason i couldn't use the ip address, so i went to use the AWS Elastic Beanstalk instead, which after another day it actually worked, it was running the api, but then i discovered that vercel apps required apis to use HTTPS only, and if i wanted a certificate for the api i had to pay, and to be honest, it wasn’t that much, i found a host for was about 4R$, which is super cheap, but the api was more of a novelty than a necessity, there was no reason for me to actually use a api in the first place, since it doesn’t hold any sensitive data like personal data, only this blogs data, and the projects, i mainly wanted to use a api to show that i know how to do it, i know how to deploy a api online, how to host a mongo Database, and even with AWS, i did managed to work out, but since i had to pay, i decided to just store this data in a json inside the project, which kinda makes all that a bit of a waste of time, but oh well, at least i learned a thing or two.\nThe Fifth week was a bit more productive, i mainly re-did the grid for the anotherflix project, and i rebuilt it to use the aspect ratio of the game box art, It wasn’t really that hard, but it was a lot of work, mainly because i had to find the cover art for the games, and they have to have a good quality, i did found a website that stored a lot of those old boxes, but i had to edit a lot of they to be in the 5:7 Aspect Ratio, so the image would look nice and crisp, i also had to some math to get the carousel to actually work properly, but looking at now, i’m kind of proud, i will add some more columns and stuff later.\nThis post is a bit shorter cuz I am a bit tired of this week so, bye.",
      "date": "2023-09-08T16:23:29.024Z",
      "locale": "en-US"
    },
    {
      "title": "Quarta e Quinta Semanas",
      "post": "A Quarta Semana de blog foi estranha, no começo eu ia atualizar o AnotherFlix, mas na segunda fui trabalhar com meu pai, depois na terça descobri que o app que usei para hospedar a API do portfólio ia me cobrar dinheiros se eu usasse mais, então fui para a AWS para encontrar um jeito de consertar isso, eu nem sabia se conseguiria usar a AWS, visto que ano passado eu fui criar uma conta pessoal e eles exigiram um tipo específico de cartão de crédito que eu não tinha, mas felizmente eles consertaram isso e eu pude usar meu cartão. No começo tentei usar o EC2, demorei um dia inteiro para configurar minha conta e fazer o servidor EC2 abrir, depois gastei mais um dia para consertar o servidor do node para poder rodar o pm2, aí por algum motivo não consegui usar o ip que eles me mandaram para fazer as requisições, então fui usar o AWS Elastic Beanstalk, que funcionou para minha surpresa, ele estava executando a API certinho, mas então descobri que os aplicativos vercel exigem que as APIs usassem apenas HTTPS, e se eu quisesse um certificado para a API eu teria que pagar, e pra ser sincero não era tão caro, encontrei um host por uns 4R$ na GoDaddy, mas a api era mais uma maneira de me exibir do que uma necessidade, não tinha motivo para mim para realmente usar uma API em primeiro lugar, já que ela não contém nenhum dado sensível como dados pessoais dos usuarios, apenas dados do meu blog e projetos, coisas que qualquer um lê, eu queria usar uma API principalmente para mostrar que eu sei como fazer essas coisa, eu sei como deployar uma api online, como hospedar um banco de dados mongo, e até com AWS eu consegui fazer dar certo, mas como teria que pagar, resolvi apenas armazenar esses dados em um json dentro do projeto, o que meio que torna tudo isso uma perda de tempo, mas tudo bem, pelo menos aprendi uma ou duas coisas no processo.\nA quinta semana foi um pouco mais produtiva, refiz principalmente o grid do carrossel do AnotherFlix, eu reconstruí para poder usar a arte da box do jogo, ao invés de fazer minha própria arte, não foi tão difícil, mas foi trabalhoso, principalmente porque tive que encontrar as capas dos jogos em boa qualidade, depois de uma boa procura eu achei um site que guardava muitas daquelas artes antigas, mas tive que editar muitas delas para ficarem no Aspect Ratio Correto (5:7), fazendo assim a imagem ficar bonita e nítida, também tive que fazer alguns cálculos para fazer o carrossel funcionar corretamente, mas depois desse trabalho todo, olhando agora, estou meio orgulhoso, adicionarei mais algumas colunas e outras coisas mais tarde.\nEste post é um pouco mais curto porque estou um pouco cansado desta semana, então, tchau.",
      "date": "2023-09-08T16:23:29.024Z",
      "locale": "pt-BR"
    }
  ]
}
]
