[
  {
    "id":"1",
    "Name":"AnotherFlix",
    "SubTitle":"An Netflix UI Clone",
    "Description":"A Simple UI Clone of Netflix, as always, is more to train the techniques used than actually making a ground-breaking website, still was kind of fun to make this, especially the artwork, which some are custom made to get this Netflix style, most i got from official art, but the Kirby especially the melee ones i made, the latter of which i took the screenshots used. Besides that, i still need to finish, at least the main menu, things like making the card clickable or the responsivity of the site.",
    "ImageUrl":"https://i.ibb.co/4dY2hWw/blur.jpg",
    "Link":"https://anotherflix.vercel.app/",
    "GitLink":"https://github.com/GuztaJF-DS/portfolio"
  },
  {
    "id":"2",
    "Name":"Spotify UI Clone",
    "SubTitle":"The name says it all",
    "Description":"This is an unfinished clone of Spotify, i did it in January 2022, but before finishing it i got my first job, and I'm not going to finish because the code isn't that great, since i got a lot better at code i can see this now, but I'm still going to show because i think it looks good enough, it was also fun to code this, so i have some good memories about it.\n I also am not sure about the copyright part, i don't think it has any problem using real album covers, since i don't actually play the songs, anyway feel free to look.",
    "ImageUrl":"https://i.ibb.co/4dY2hWw/blur.jpg",
    "Link":"https://spotifycloneui.netlify.app/",
    "GitLink":"https://github.com/GuztaJF-DS/SpotifyUiClone"
  },
  {
    "id":"3", 
    "Name":"API Requester",
    "SubTitle":"An app to show my APIs (or another one)",
    "Description":"After realizing that i did some backend-only projects, i decided that i should have some sort of way of displaying them, so i did this app that executes requests, although i planned to use it with my APIs, you can request any API here.\nI did this project in Vue JS, i wanted to do something different, and i liked Vue, althought there were some things i didn't like (mainly some shortcuts i can do in React), i think my expirience using it was positive, and i plan to fully adapt to it, and learn how to do some of those tricks i got used in React.\nI also want to add some features, like create some inputs to make requesting my own APIs easier {and} Add my other APIs.",
    "ImageUrl":"https://i.ibb.co/4dY2hWw/blur.jpg",
    "Link":"https://api-requester.vercel.app/",
    "GitLink":"https://github.com/GuztaJF-DS/Api-requester"
  }

]